---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.GetBasicIEnumerator
source: html/4e29b590-3f5f-7212-ec93-05134efbe113.htm
---
# Autodesk.Revit.DB.ExportLayerTable.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.